app/controllers/songs_controller.rb

  def edit
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      redirect_to(artists_path, alert: "Artist not Found") if @artist.nil?
    end
    if Song.exists?(params[:id])
      @song = Song.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT "songs".* FROM "songs"
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]